
List <String> area = ["","Bani Kinanah","Alramtha","irbid city","Alwasatea","Alshonah","Bani 3baid","Almazar","Altaibah","Alkorah"];
//غراف يمثل الوية اربد ال 9 وكل لواء مع مين متصل
Map<int, List<int>> graph = {
  1: [3,4,2],      //بني كنانه
  2: [3,6,1],       //الرمثا
  3: [6,1,4,8,7,2], //قصبة اربد
  4: [8,5,3,1],     //الوسطية
  5: [4,8,9],     //الشونة
  6: [3,7,2],       //بني عبيد
  7: [6,3,9],       //المزار
  8: [4,3,5,9],     //الطيبة
  9: [8,7,5],       //الكورة
};



//أحدث حملات التبرع
String compaigns = """1-Blood Donation Campaign at Yarmouk University, Call: 0778456855
2-Blood Donation Campaign at King Hussein Cancer Center, Call: 0778468941
3-Blood donation campaign in Irbid Blood Bank, Call: 0774521100

""";



//المستفيات التي يمكن الحجز فيها
Map<int,String> hospitals ={
  1 : "1-Princess Basma Educational Hospital",
  2: "2-Princess Rahma Educational Hospital",
  3: "3-Al-Yarmouk Governmental Hospital",
  4: "4-Irbid Islamic Hospital",
  5: "5-Ibn Al-Nafis Hospital",
  6: "6-King Abdullah University Hospital",
};




//بيانات المتبرعين
Map<int, List<List<String>>> data = {
  1: [
    ["Ali", "O-", "0778541125"],
    ["Saleh", "O+", "0772687425"],
    ["Omar", "A-", "0755577125"],
    ["Khalid", "B-", "0755551133"],
    ["Sara", "AB+", "0788884412"],
    ["Lina", "A+", "0785511266"],
    ["Hana", "O-", "0777411225"],
    ["Fahad", "B+", "0795512241"],
    ["Tariq", "AB-", "0789911477"],
    ["Mona", "A+", "0779993215"],
  ],
  2: [
    ["Ahmad", "O+", "0771112233"],
    ["Noor", "A-", "0752223344"],
    ["Mariam", "B-", "0783334455"],
    ["Layla", "AB+", "0774445566"],
    ["Hassan", "O-", "0795556677"],
    ["Yara", "A+", "0786667788"],
    ["Zaid", "B+", "0757778899"],
    ["Nour", "AB-", "0788889900"],
    ["Samir", "O+", "0799990011"],
    ["Dina", "A-", "0770001122"],
  ],
  3: [
    ["Fadi", "B-", "0751234567"],
    ["Maha", "O+", "0772345678"],
    ["Rami", "A-", "0783456789"],
    ["Salma", "AB+", "0794567890"],
    ["Nader", "O-", "0785678901"],
    ["Alaa", "A+", "0776789012"],
    ["Jana", "B+", "0787890123"],
    ["Ola", "AB-", "0758901234"],
    ["Karem", "O+", "0799012345"],
    ["Huda", "A-", "0770123456"],
  ],
  4: [
    ["Yousef", "B-", "0755678901"],
    ["Rana", "O+", "0776789012"],
    ["Ali2", "A-", "0787890123"],
    ["Fatima", "AB+", "0798901234"],
    ["Ibrahim", "O-", "0789012345"],
    ["Zainab", "A+", "0770123456"],
    ["Hadi", "B+", "0781234567"],
    ["Nada", "AB-", "0752345678"],
    ["Saif", "O+", "0793456789"],
    ["Aya", "A-", "0774567890"],
  ],
  5: [
    ["Khalil", "B-", "0756789012"],
    ["Lamar", "O+", "0777890123"],
    ["Anas", "A-", "0788901234"],
    ["Shahd", "AB+", "0799012345"],
    ["Farah", "O-", "0780123456"],
    ["Bilal", "A+", "0771234567"],
    ["Nada", "B+", "0782345678"],
    ["Sami", "AB-", "0753456789"],
    ["Rama", "O+", "0794567890"],
    ["Tamer", "A-", "0775678901"],
  ],
  6: [
    ["Hussein", "B-", "0758901234"],
    ["Reem", "O+", "0779012345"],
    ["Nasser", "A-", "0780123456"],
    ["Haya", "AB+", "0791234567"],
    ["Ali3", "O-", "0782345678"],
    ["Mariam", "A+", "0773456789"],
    ["Omar", "B+", "0784567890"],
    ["Lina", "AB-", "0755678901"],
    ["Sara", "O+", "0796789012"],
    ["Tariq", "A-", "0777890123"],
  ],
  7: [
    ["Ahmad", "B-", "0759012345"],
    ["Noor", "O+", "0770123456"],
    ["Mariam", "A-", "0781234567"],
    ["Layla", "AB+", "0792345678"],
    ["Hassan", "O-", "0783456789"],
    ["Yara", "A+", "0774567890"],
    ["Zaid", "B+", "0785678901"],
    ["Nour", "AB-", "0756789012"],
    ["Samir", "O+", "0797890123"],
    ["Dina", "A-", "0778901234"],
  ],
  8: [
    ["Fadi", "B-", "0752345678"],
    ["Maha", "O+", "0773456789"],
    ["Rami", "A-", "0784567890"],
    ["Salma", "AB+", "0795678901"],
    ["Nader", "O-", "0786789012"],
    ["Alaa", "A+", "0777890123"],
    ["Jana", "B+", "0788901234"],
    ["Ola", "AB-", "0759012345"],
    ["Karem", "O+", "0790123456"],
    ["Huda", "A-", "0771234567"],
  ],
  9: [
    ["Yousef", "B-", "0754567890"],
    ["Rana", "O+", "0775678901"],
    ["Ali4", "A-", "0786789012"],
    ["Fatima", "AB+", "0797890123"],
    ["Ibrahim", "O-", "0788901234"],
    ["Zainab", "A+", "0779012345"],
    ["Hadi", "B+", "0780123456"],
    ["Nada", "AB-", "0751234567"],
    ["Saif", "O+", "0792345678"],
    ["Aya", "A-", "0773456789"],
  ],
};